In [ ]:
print('hello')

In [ ]:
import this

#EXTRACTION OF DIGITS

In [ ]:
def extract_number(number):
    remaining_nbr=number
    print(number)
    count=0
    while remaining_nbr>0:
        print('remaining:',remaining_nbr)
        digit=remaining_nbr%10
        # remaining_nbr=remaining_nbr//10
        # remaining_nbr,digit=divmod(remaining_nbr,digit)
        remaining_nbr=remaining_nbr//10
        count+=1
        print(digit,"end=")
    # print()
    return(count)#  his used when to get digit of number
extract_number(20)

 #pandas data table representation

In [3]:
import pandas as pd
df=pd.DataFrame(
  {
  "Age": [22, 35, 58,20,10,23,34,45],
  "Name":[
  "Braund,Mr.OwenHarris",
  "Allen,Mr.WilliamHenry",
  "Bonnell,Miss.Elizabeth",
  "Braund,Mr.OwenHarris",
  "Allen,Mr.WilliamHenry",
  "Bonnell,Miss.Elizabeth",
  "patrick.Muvunyi",
  "data,dataframe"
  ],
 "Sex": ["male", "male", "female","male", "male", "female","male", "male"],
})
df

   Age                    Name     Sex
0   22    Braund,Mr.OwenHarris    male
1   35   Allen,Mr.WilliamHenry    male
2   58  Bonnell,Miss.Elizabeth  female
3   20    Braund,Mr.OwenHarris    male
4   10   Allen,Mr.WilliamHenry    male
5   23  Bonnell,Miss.Elizabeth  female
6   34         patrick.Muvunyi    male
7   45          data,dataframe    male

In [ ]:
df.loc[1:1]

In [ ]:
# df.Age[2]
# df.Age.mean()
df.describe()

In [57]:
import numpy as np
data=pd.Series([1,2,3,4,np.nan,5])
# //convert from the DataFrame to numpy
data.to_numpy

<bound method IndexOpsMixin.to_numpy of 0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
dtype: float64>

In [58]:
# this transpose data
data.T

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
dtype: float64

#sort by axis

In [64]:
we use the axis=1 or 0
df.sort_index(axis=0,ascending=False)

   Age                    Name     Sex
2   58  Bonnell,Miss.Elizabeth  female
1   35   Allen,Mr.WilliamHenry    male
0   22    Braund,Mr.OwenHarris    male

#sorting by values

In [67]:
df.sort_values(by="Age")

   Age                    Name     Sex
0   22    Braund,Mr.OwenHarris    male
1   35   Allen,Mr.WilliamHenry    male
2   58  Bonnell,Miss.Elizabeth  female

selection

In [4]:
df.Name

0      Braund,Mr.OwenHarris
1     Allen,Mr.WilliamHenry
2    Bonnell,Miss.Elizabeth
3      Braund,Mr.OwenHarris
4     Allen,Mr.WilliamHenry
5    Bonnell,Miss.Elizabeth
6           patrick.Muvunyi
7            data,dataframe
Name: Name, dtype: object

#date time

In [42]:
# daterange=pd.date_range('20240506',periods=6)
#  df2 =pd.DataFrame(
#      {
#         "A":1.0,
#         "B":pd.Timestamp("20130102"),
#         "C":pd.Series(1,index=list(range(4)),dtype="float32"),
#         "D":np.array([3]*4,dtype="int32"),
#         "E":pd.Categorical(["test","train","test","train"]),
#         "F":"foo",
#      }
#  )

IndentationError: unexpected indent (67823451.py, line 2)